<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the MakeMKV application.</string>
	<key>Identifier</key>
	<string>com.home.download.MakeMKV</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MakeMKV</string>
		<key>URL</key>
		<string>http://www.makemkv.com/download/</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%URL%</string>
				<key>re_pattern</key>
				<string>(download\/makemkv_v[0-9.]*_osx\.dmg)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://www.makemkv.com/%match%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
